{
	"ranks": [
		{
			"available": "5/18",
			"requires": {
				"persona": {
					"name": "Jack Frost",
					"ability": "Mabufu"
				}
			},
			"text": "Jack Frost learns this ability at level 12, and with Morgana's cooperation arcana burst you should be able to make one that hits this level easily. To make Jack Frost, fuse Berith (Hierophant) with Apsaras (Priestess). These Persona are available in the first palace and in early areas of mementos.",
			"rank": "1",
			"unlocks": {
				"abilities": ["groupGuillotine"]
			}
		},
		{
			"requires": {
				"persona": {
					"name": "Shiissa",
					"ability": "Frei"
				}
			},
			"text": "To get a Shiissa with Frei you'll need to fuse Jack Frost (Magician) with Makami (Temperance). Makami will have Frei, and so you can choose for the resulting Shiissa to inherit the skill.",
			"rank": "2"
		},
		{
			"requires": {
				"persona": {
					"name": "Matador",
					"ability": "Magaru"
				}
			},
			"text": "To get a Matador with Magaru you should combine Mokoi (Death) with Regent, a rare Treasure Persona - then select Magaru as an inherited skill. You could also achieve this persona by fusing Nekomata (Magician) with Obariyon (Fool) and inherit Magaru.",
			"rank": "3",
			"unlocks": {
				"abilities": ["lockdown"]
			}
		},
		{
			"requires": {
				"persona": {
					"name": "Flauros",
					"ability": "Tarukaja"
				}
			},
			"text": "To get this Persona you need to do a group guillotine fusion: Berith (Hierophant), Andras (Devil) & Eligor (Emperor). Andras will learn Tarukaja when it levels up via Arcana Burst if you've done the Reporter cooperation some, or naturally through a bit of combat.",
			"rank": "4"
		},
		{
			"requires": {
				"persona": {
					"name": "Ame-no-Uzume",
					"ability": "Dodge Psy"
				}
			},
			"text": "Fuse Kin-Ki (Chariot) with Sui-Ki (Moon). Kin-Ki learns Dodge Psy at Level 27, so get it to that level and then select dodge psy as an inherited ability.",
			"rank": "5",
			"unlocks": {
				"abilities": ["guillotineBooster"]
			}
		},
		{
			"requires": {
				"persona": {
					"name": "Neko Shogun",
					"ability": "Dekaja"
				}
			},
			"text": "Anzu (Hierophant) learns Dekaja at level 28. Get this Persona to this level then perform an advanced fusion of Kodama (Star), Sudama (Hermit) and Anzu (Hierophant) - select Dekaja as an inherited ability.",
			"rank": "6"
		},
		{
			"requires": {
				"persona": {
					"name": "Lachesis",
					"ability": "Tetraja"
				}
			},
			"text": "To fuse this Persona, there are stages: Fuse Lamia (Empress) and Sandman (Magician) to create Principality (Justice) with Tetraja. Fuse Principality (Justice) with Yaksini (Empress) to create Ame no Uzume (Lovers) - have it inherit Tetraja. Fuse Ame no Uzume (Lovers) with Isis (Priestess) to create Lachesis - don't forget to inherit Tetraja as a skill.",
			"rank": "7"
		},
		{
			"requires": {
				"persona": {
					"name": "Hecatoncheires",
					"ability": "Masukunda"
				}
			},
			"text": "The quickest path to this persona is Unicorn (Hierophant) fused with Lilim (Devil), then inherit Masukunda. You can also fuse Clotho (Fortune) with Red Rider (Tower) or Belphegor (Tower).",
			"rank": "8",
			"unlocks": {
				"abilities": ["isolation"]
			}
		},
		{
			"requires": {
				"persona": {
					"name": "Bugs",
					"ability": "Samarecarm"
				}
			},
			"text": "Bugs requires an advanced fusion of three persona - combine Pixie (Lovers) with Pisaca (Death) and Hariti (Empress). Hariti learns Samarecarm at level 41, so boost it there then inherit it from this fusion.",
			"rank": "9"
		},
		{
			"requires": {
				"persona": {
					"name": "Seth",
					"ability": "High Counter"
				}
			},
			"text": "Getting Seth will require multiple steps once again: You'll gain a skill card from the Mementos Mission The Killer Laughs in the Garbage Can, a request gained on 10/14. This skill card is for High Counter. Save it. First, combine Hecatoncheires (Hanged) with Kushinada-Hime (Lovers) to get yourself a Horus (Sun) with the skill you need. Then combine Isis (Priestess), Thoth (Emperor), Anubis (Judgment) and Horus (Sun) in order to create Seth. Use the ability card to teach Seth High Counter.",
			"rank": "10",
			"unlocks": {
				"abilities": ["specialTreatment"],
				"fusion": "Zaou-Gongen"
			}
		}
	],
	"arcana": "Strength",
	"name": "Twin Wardens",
	"location": "Velvet Room.",
	"note": "The Twin Wardens cooperation is different from all of the others. Instead of conversation, you rank up by fulfilling their requests for a Persona with a specific ability.",
	"id": "strength_twin_wardens"
}